app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "events" WHERE ("events".user_id = 1)
---
    <span class="events">
      <%= pluralize(current_user.events.count, "event") %>