app/controllers/events_controller.rb

INSERT INTO "events" ("user_id", "created_at", "description", "event_title", "updated_at") VALUES (1, '2011-03-02 00:10:24.124734', 'There is free pizza!', 'Hey There', '2011-03-02 00:10:24.124734')
---
	def create
		@event = current_user.events.build(params[:event])
		if @event.save

DELETE FROM "events" WHERE ("events"."id" = 1)
---
	def destroy
		@event.destroy